Revit 2027 API
ParameterTypeId.BoundaryLinearRestraintY Property
 "Y Spring Modulus"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId BoundaryLinearRestraintY { get; }
Public Shared ReadOnly Property BoundaryLinearRestraintY As ForgeTypeId
	Get
public:
static property ForgeTypeId^ BoundaryLinearRestraintY {
	ForgeTypeId^ get ();
}
static member BoundaryLinearRestraintY : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace